# """
#     Testing shell_sorting.
# """
#
#
# from algorithms.sorting.shell_sorting import *
#
# from pytest
#
#
# class CompanyTesting:
#
#     company = Company()

# ['Прохоров, Виталий, Геннадиевич, 23, 50', 'Сидоров, Дмитрий, Валерьянович, 25, 75', 'Перов, Александр, Семенович, 33, 150', 'Иванов, Артур, Александрович, 43, 250']
# print(company.sort_employees_by_salary)

# ['Прохоров, Виталий, Геннадиевич, 23, 50', 'Сидоров, Дмитрий, Валерьянович, 25, 75', 'Перов, Александр, Семенович, 33, 150', 'Иванов, Артур, Александрович, 43, 250']
# print(company.sort_employees_by_ege)

# ['Иванов, Артур, Александрович, 43, 250', 'Сидоров, Дмитрий, Валерьянович, 25, 75', 'Прохоров, Виталий, Геннадиевич, 23, 50', 'Перов, Александр, Семенович, 33, 150']
# print(company.sort_employees_by_patronymic)

# ['Перов, Александр, Семенович, 33, 150', 'Иванов, Артур, Александрович, 43, 250', 'Прохоров, Виталий, Геннадиевич, 23, 50', 'Сидоров, Дмитрий, Валерьянович, 25, 75']
# print(company.sort_employees_by_name)

# ['Иванов, Артур, Александрович, 43, 250', 'Перов, Александр, Семенович, 33, 150', 'Прохоров, Виталий, Геннадиевич, 23, 50', 'Сидоров, Дмитрий, Валерьянович, 25, 75']
# print(company.sort_employees_by_family_name)
